// 価格のデータを読み出して、prices.jsonを作成する
const log = console.log

const fs = require("fs")

// ベジ探のファイルからをデータを取得するクラス
function Vegetan() {
  let name_list = [
    "キャベツ", "ほうれんそう", "はくさい", "ねぎ", "レタス", "ブロッコリー",
    "もやし", "かんしょ", "ばれいしょ", "さといも", "だいこん", "にんじん", 
    "ごぼう", "たまねぎ", "れんこん", "たけのこ", "さやまめ", "かぼちゃ",
    "きゅうり", "なす", "トマト", "ピーマン", "生しいたけ", "しめじ", 
    "えのきたけ", "米類", "食パン", "小麦粉", "まぐろ", "あじ", "いわし", 
    "かつお", "かれい", "さけ", "さば", "さんま", "たい", "ぶり", "いか", "たこ",
    "えび", "かに", "あさり", "しじみ", "かき", "ほたて貝", "たらこ",
    "しらす干し", "干しあじ", "牛肉", "豚肉", "鶏肉", "合いびき肉", "ハム",
    "ソーセージ", "ベーコン",
  ]

  // 日本食品標準成分表の食品名をキーにして、ベジ探の食品名を値にする
  let name_obj = {
    "（キャベツ類）　キャベツ　結球葉　生": "キャベツ",
    "ほうれんそう　葉　夏採り　生": "ほうれんそう",
    "ほうれんそう　葉　冬採り　生": "ほうれんそう",
    "はくさい　結球葉　生": "はくさい",
    "（ねぎ類）　根深ねぎ　葉　軟白　生": "ねぎ",
    "（レタス類）　レタス　土耕栽培　結球葉　生": "レタス",
    "ブロッコリー　花序　生": "ブロッコリー",
    "（もやし類）　だいずもやし　生": "もやし",
    "（もやし類）　りょくとうもやし　生": "もやし",
    "＜いも類＞（さつまいも類）さつまいも　塊根　皮むき　生": "かんしょ",
    "＜いも類＞（さつまいも類）さつまいも　塊根　皮つき　生": "かんしょ",
    "＜いも類＞（さといも類）　さといも　球茎　生": "さといも",
    "（だいこん類）　だいこん　根　皮つき　生": "だいこん",
    "（だいこん類）　だいこん　根　皮むき　生": "だいこん",
    "（にんじん類）　にんじん　根　皮つき　生": "にんじん",
    "（にんじん類）　にんじん　根　皮むき　生": "にんじん",
    "ごぼう　根　生": "ごぼう",
    "（たまねぎ類）　たまねぎ　りん茎　生": "たまねぎ",
    "れんこん　根茎　生": "れんこん",
    "たけのこ　若茎　生": "たけのこ",
    "（かぼちゃ類）　西洋かぼちゃ　果実　生": "かぼちゃ",
    "きゅうり　果実　生": "きゅうり",
    "（なす類）　なす　果実　生": "なす",
    "（トマト類）　トマト　果実　生": "トマト",
    "（トマト類）　ミニトマト　果実　生": "トマト",
    "（ピーマン類）　青ピーマン　果実　生": "ピーマン",
    "（ピーマン類）　赤ピーマン　果実　生": "ピーマン",
    "（ピーマン類）　黄ピーマン　果実　生": "ピーマン",
    "しいたけ　生しいたけ　菌床栽培　生": "生しいたけ",
    "（しめじ類）　ぶなしめじ　生": "しめじ",
    "えのきたけ　生": "えのきたけ",
    "こめ　［水稲穀粒］　精白米　うるち米": "米類",
    "こむぎ　［パン類］　食パン": "食パン",
    "こむぎ　［小麦粉］　薄力粉　2等": "小麦粉",
    "こむぎ　［小麦粉］　中力粉　2等": "小麦粉",
    "こむぎ　［小麦粉］　強力粉　2等": "小麦粉",
    "＜魚類＞（まぐろ類）　びんなが　生": "まぐろ",
    "＜魚類＞（まぐろ類）　めばち　生": "まぐろ",
    "＜魚類＞（あじ類）　まあじ　皮つき、生": "あじ",
    "＜魚類＞（いわし類）　まいわし　生": "いわし",
    "＜魚類＞（かつお類）　かつお　春獲り　生": "かつお",
    "＜魚類＞（かつお類）　かつお　秋獲り　生": "かつお",
    "＜魚類＞（かれい類）　まがれい　生": "かれい",
    "＜魚類＞（さけ・ます類）　べにざけ　生": "さけ",
    "＜魚類＞（さば類）　まさば　生": "さば",
    "＜魚類＞さんま　皮つき、生": "さんま",
    "＜魚類＞（たい類）　まだい　養殖　皮つき　生": "たい",
    "＜魚類＞ぶり　成魚　生": "ぶり",
    "＜いか・たこ類＞（いか類）　するめいか　生": "いか",
    "＜いか・たこ類＞（たこ類）　まだこ　生": "たこ",
    "＜えび・かに類＞（えび類）　くるまえび　養殖　生": "えび",
    "＜えび・かに類＞（かに類）　毛がに　生": "かに",
    "＜貝類＞あさり　生": "あさり",
    "＜貝類＞しじみ　生": "しじみ",
    "＜貝類＞かき　養殖　生": "かき",
    "＜貝類＞ほたてがい　生": "ほたて貝",
    "＜魚類＞（たら類）　すけとうだら　たらこ　生": "たらこ",
    "＜魚類＞（いわし類）　しらす干し　微乾燥品": "しらす干し",
    "＜魚類＞（いわし類）　しらす干し　半乾燥品": "しらす干し",
    "＜魚類＞（あじ類）　まあじ　開き干し　生": "干しあじ",
  }
  
  let vegetan_datas = {}
  
  for(let filename of name_list){
    let csv = fs.readFileSync("./vegetan/" + filename + ".csv", "utf8")
    let lines = csv.replace(/\r\n/g, "\n").split("\n")
    let foodName = lines[3].replace(/品 目：|"/g, "")
    let prices = [] // 1グラムあたりの価格のリスト
    
    for(let line of lines.splice(7, 24)){
      let cells = line.split(",")
      let weight = cells[2]
      let price = cells[3]
  
      prices.push(price / weight)
    }
  
    let priceSum = 0
    let priceAve = 0
    prices.forEach(p => priceSum+=p)
    priceAve = priceSum / prices.length
  
    vegetan_datas[foodName] = priceAve
  }

  this.get_price_par_gram = (name) => {
    if(name_obj[name] == undefined){
      return null
    }

    let foodName = name_obj[name]
    return vegetan_datas[foodName]
  }
}


// prices.jsonの作成
let vegetan = new Vegetan()
let food_names_json = fs.readFileSync("../food_names.json", "utf8")

let prices = JSON.parse(food_names_json)

prices.foods = prices.foods.map(food => {
  let vegetan_value = vegetan.get_price_par_gram(food[1])
  if(vegetan_value != null){
    let price = vegetan_value*100
    food.push(String(price))
  }else{
    food.push("-")
  }
  return food
})

let jsonData = JSON.stringify(prices, null, 4)
  .replace(/\[.*?\n.*?"/g, '["')
  .replace(/",.*?\n.*?"/g, '", "')
  .replace(/"\n.*?]/g, '"]')

fs.writeFileSync("prices.json", jsonData)